In [1]:
import pandas as pd
import numpy as np

In [13]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350],
       'AfterSales':[100,200,200,150,250,10]}

In [14]:
df = pd.DataFrame(data)
df

  Company   Person  Sales  AfterSales
0    GOOG      Sam    200         100
1    GOOG  Charlie    120         200
2    MSFT      Amy    340         200
3    MSFT  Vanessa    124         150
4      FB     Carl    243         250
5      FB    Sarah    350          10

In [15]:
gb = df.groupby('Company')
gb

In [16]:
gb.mean()

         Sales  AfterSales
Company
FB       296.5       130.0
GOOG     160.0       150.0
MSFT     232.0       175.0

In [17]:
gb.sum()

         Sales  AfterSales
Company
FB         593         260
GOOG       320         300
MSFT       464         350

In [18]:
gb.std()

              Sales  AfterSales
Company
FB        75.660426  169.705627
GOOG      56.568542   70.710678
MSFT     152.735065   35.355339

In [20]:
gb.sum().loc['FB']

Sales         593
AfterSales    260
Name: FB, dtype: int64

In [21]:
df.groupby('Company').sum().loc['FB']

Sales         593
AfterSales    260
Name: FB, dtype: int64

In [25]:
gb.count()

         Person  Sales  AfterSales
Company
FB            2      2           2
GOOG          2      2           2
MSFT          2      2           2

In [30]:
gb.min()

          Person  Sales  AfterSales
Company
FB          Carl    243          10
GOOG     Charlie    120         100
MSFT         Amy    124         150

In [37]:
gb.describe()

        Sales                                                          \
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

        AfterSales
             count   mean         std    min    25%    50%    75%    max
Company
FB             2.0  130.0  169.705627   10.0   70.0  130.0  190.0  250.0
GOOG           2.0  150.0   70.710678  100.0  125.0  150.0  175.0  200.0
MSFT           2.0  175.0   35.355339  150.0  162.5  175.0  187.5  200.0

In [41]:
gb.describe().transpose()['FB']

Sales       count      2.000000
            mean     296.500000
            std       75.660426
            min      243.000000
            25%      269.750000
            50%      296.500000
            75%      323.250000
            max      350.000000
AfterSales  count      2.000000
            mean     130.000000
            std      169.705627
            min       10.000000
            25%       70.000000
            50%      130.000000
            75%      190.000000
            max      250.000000
Name: FB, dtype: float64